min_dep = 0.2  # Какой минимальный ДЕПОЗИТ по УМОЛЧАНИЮ
max_dep = 10000 # Какой максимальный ДЕПОЗИТ по УМОЛЧАНИЮ
min_withdraw = 0.5 # Какой минимальный ВЫВОД по УМОЛЧАНИЮ
min_ref_withdraw = 1 # Какой минимальный ВЫВОД по УМОЛЧАНИЮ
flag_bonus_ref = 0 # Флаг для конкурса по рефке: 1 - Включен; 0 - Выключен
amount_bonus_ref = 0.6 # Сколько $ дается за каждых 10 рефералов
flag_bonus_pripiska = 0 # Флаг для конкурса с припиской в нике: 1 - Включен; 0 - Выключен
referal_precent = 10 # Реферальный процент в боте!

# Список игр через бота
GAMES = {
    "cube": {
        "title": "🎲 Кубик",
        "emoji": "🎲",
        "bets": {
            "chet": "Чёт",
            "nechet": "Нечёт",
            "more": "Больше",
            "less": "Меньше",
            "1": "1",
            "2": "2",
            "3": "3",
            "4": "4",
            "5": "5",
            "6": "6",
        }
    },

    "cubes": {
        "title": "🎲🎲 Кубы",
        "emoji": "🎲🎲",
        "bets": {
            "pobeda1": "Победа 1",
            "pobeda2": "Победа 2",
            "2m": "2 Меньше",
            "2b": "2 Больше",
            "2chet": "2 Чёт",
            "2nechet": "2 Нечёт",
            "nicheya": "Ничья",
            "sector1": "Сектор 1",
            "sector2": "Сектор 2",
            "sector3": "Сектор 3",
            "plinko": "Плинко",
        }
    },

    "basket": {
        "title": "🏀 Баскетбол",
        "emoji": "🏀",
        "bets": {
            "basket_goal": "Гол",
            "basket_miss": "Промах",
        }
    },

    "football": {
        "title": "⚽ Футбол",
        "emoji": "⚽",
        "bets": {
            "goal": "Гол",
            "miss": "Промах",
        }
    },

    "bowling": {
        "title": "🎳 Боулинг",
        "emoji": "🎳",
        "bets": {
            "duel": "Дуэль",
        }
    },

    "darts": {
        "title": "🎯 Дартс",
        "emoji": "🎯",
        "bets": {
            "red": "Красное",
            "white": "Белое",
            "center": "Центр",
            "darts_miss": "Промах",
            "darts_duel": "Дуэль",
        }
    },

    "slots": {
        "title": "🎰 Слоты",
        "emoji": "🎰",
        "bets": {
            "slot": "Слоты",
        }
    },

    "rps": {
        "title": "✊✌️✋",
        "emoji": "✊",
        "bets": {
            "rock": "Камень",
            "scissors": "Ножницы",
            "paper": "Бумага",
        }
    },
}

# Список коэффициентов в боте
GAME_COEFFICIENTS = {
    "": ['плинко'],
    1.4: [
        'баскет промах', 'баскет мимо', 'баскетбол промах', 'баскетбол мимо',
        'фут гол', 'футбол гол', 'фут попал', 'футбол попал'
    ],
    1.7: [
        'баскет гол', 'баскет попал', 'баскетбол гол', 'баскетбол попал',
        'футбол мимо', 'фут мимо', 'футбол промах', 'фут промах'
    ],
    1.85: [
        'чет', 'нечет', 'больше', 'меньше',
        'победа 1', 'победа 2', 'п1', 'победа2', 'п2',
        'боул дуэль', 'боулинг дуэль',
        'красное', 'красн', 'белое', 'бел',
        'дартс дуэль'
    ],
    2.2: [
        # КНБ
        'камень', 'ножницы', 'бумага'
    ],
    2.4: [
        'сектор1', 'сектор 1', 'сектор2', 'сектор 2', 'сектор3', 'сектор 3'
    ],
    2.5: [
        'дартс промах', 'дартс мимо', 'дарц промах', 'дарц мимо'
    ],
    3.0: [
        '2 чет', '2чет', '2 нечет', '2нечет',
        '2м', '2 меньше', '2меньше',
        '2б', '2 больше', '2больше',
        '2ч', '2н',
        'центр', 'яблочко', 'дартс центр', 'дартс яблочко',
        '🍋🍋🍋', 'слоты лимон', 'слот лимон'
    ],
    4.0: [
        '1', '2', '3', '4', '5', '6',
        'ничья',
        '🫐🫐🫐', 'слоты ягода', 'слот ягода'
    ],
    7.0: [
        '🎰🎰🎰', 'слоты джекпот', 'слот джекпот', 'джекпот', "слоты", "казик"
    ]
}

BET_TRANSLATIONS = {
    "chet": "чёт",
    "nechet": "нечёт",
    "more": "больше",
    "less": "меньше",
    "nicheya": "ничья",
    "pobeda1": "победа 1",
    "pobeda2": "победа 2",
    "p1": "победа 1",
    "p2": "победа 2",
    "2m": "2 меньше",
    "2b": "2 больше",
    "2chet": "2 чет",
    "2nechet": "2 нечет",
    "sector1": "сектор 1",
    "sector2": "сектор 2",
    "sector3": "сектор 3",
    "1": "1",
    "2": "2",
    "3": "3",
    "4": "4",
    "5": "5",
    "6": "6",

    "red": "красное",
    "white": "белое",
    "center": "центр",
    "darts_miss": "дартс промах",
    "darts_duel": "дартс дуэль",

    "slot": "слоты",
    
    "basket_goal": "баскет гол",
    "basket_miss": "баскет промах",
    
    "goal": "футбол гол",
    "miss": "футбол промах",
    
    "plinko": "плинко",

    "duel": "боулинг дуэль",
    
    "rock": "камень",
    "scissors": "ножницы",
    "paper": "бумага",
}


minnes_kef = {
    2: [1.02, 1.11, 1.22, 1.34, 1.48, 1.65, 1.84, 2.07, 2.35, 2.69, 3.1, 3.62, 4.27, 5.13, 6.27, 7.83, 10.07, 13.43, 18.8, 28.2, 47, 94, 282],
    3: [1.07, 1.22, 1.4, 1.63, 1.9, 2.23, 2.65, 3.18, 3.86, 4.75, 5.94, 7.56, 9.83, 13.1, 18.02, 25.74, 38.61, 61.77, 108.1, 216.2, 540.5, 2162],
    4: [1.12, 1.34, 1.63, 1.99, 2.45, 3.07, 3.89, 5, 6.53, 8.71, 11.88, 16.63, 24.02, 36.03, 56.62, 94.37, 169.87, 339.74, 792.73, 2378.2, 11891],
    5: [1.18, 1.48, 1.9, 2.45, 3.22, 4.29, 5.83, 8.07, 11.43, 16.63, 24.95, 38.81, 63.06, 108.1, 198.18, 396.37, 891.82, 2378.2, 8323.7, 49942.2],
    6: [1.24, 1.65, 2.23, 3.07, 4.29, 6.14, 8.97, 13.45, 20.79, 33.26, 55.44, 97.01, 180.17, 360.33, 792.73, 1981.83, 5945.5, 23782, 166474],
    7: [1.31, 1.84, 2.65, 3.89, 5.83, 8.97, 14.2, 23.23, 39.5, 70.22, 131.66, 263.32, 570.53, 1369.27, 3765.48, 12551.61, 56482.25, 451858],
    8: [1.38, 2.07, 3.18, 5, 8.07, 13.45, 23.23, 41.82, 79, 157.99, 338.55, 789.96, 2053.9, 6161.7, 22592.9, 112964.5, 1016680.5],
    9: [1.47, 2.35, 3.86, 6.53, 11.43, 20.79, 39.5, 79, 167.87, 383.7, 959.24, 2685.87, 8729.07, 34916.3, 192039.65, 1920396.5],
    10: [1.57, 2.69, 4.75, 8.71, 16.63, 33.26, 70.22, 157.99, 383.7, 1023.19, 3069.56, 10743.48, 46555.07, 279330.4, 3072634.4],
    11: [1.68, 3.1, 5.94, 11.88, 24.95, 55.44, 131.66, 338.55, 959.24, 3069.56, 11510.87, 53717.38, 349163, 4189956],
    12: [1.81, 3.62, 7.56, 16.63, 38.81, 97.01, 263.32, 789.96, 2685.87, 10743.48, 53717.38, 376021.69, 4888282],
    13: [1.96, 4.27, 9.83, 24.02, 63.06, 180.17, 570.53, 2053.9, 8729.08, 46555.07, 349163, 4888282],
    14: [2.14, 5.13, 13.1, 36.03, 108.1, 360.33, 1369.27, 6161.7, 34916.3, 279330.4, 4189956],
    15: [2.35, 6.27, 18.02, 56.62, 198.18, 792.73, 3765.48, 22592.9, 192039.65, 3072634.4],
    16: [2.61, 7.83, 25.74, 94.37, 396.37, 1981.83, 12551.61, 112964.5, 1920396.5],
    17: [2.94, 10.07, 38.61, 169.87, 891.83, 5945.5, 56482.25, 1016680.5],
    18: [3.36, 13.43, 61.77, 339.74, 2378.2, 23782, 451858],
    19: [3.92, 18.8, 108.1, 792.73, 8323.7, 166474],
    20: [4.7, 28.2, 216.2, 2378.2, 49942.2],
    21: [5.88, 47, 540.5, 11891],
    22: [7.83, 94, 2162],
    23: [11.75, 282],
    24: [23.5]
}