""" Ключ-слова для определения рекламы в нике! """
invalid_characters = ['@', 't.me', 'tether' 
                      ,'Tetherbet', 'Tears', 
                      '///MEGA', '/// MEGA', 'LudoCasino', 
                      'Ludocasino','ludoCasino', 'ludocasino', 
                      'CartCasino', 'Cartcasino', 'cartcasino', 
                      'cartCasino','TearsCasino', 'FaxBet', 'FAXBET', 
                      'faxbet', 'Faxbet', 'faxBet', ' /// TPGgame', 
                      'TPGgame','Tether', 'TetherBet', 'tetherbet', 'teather bet', 
                      'Tether bet', 'Tether Bet', 'tpg', 'bet','Bet', 'BET', 'TPG', 
                      'GAME', 'game', 'Tpg', 'extra', 'casino', 'Casino', 'Extra', 
                      '|', 'LuxuryBet','.com', 'https', '//:', 'http', 'www', '.org', 
                      '.net', '.ru', 'Space', 'Cube', 'T.ME', 'CASINO','ИЩИ', 'ИГРАТЬ',
                    'ЛУЧШЕЕ', 'КАЗИНО' 'cas', 'T.ME', 'T.me', 't.ME', 'T.mE', 't.mE', 
                    't.Me','T.me', 'keshcasino','KESHCASINO.T.ME', 'KESHCASINO', 'CryptoBet',
                    'CrystalSpin_robot', 'CrystalSpin', 'sneaky']

""" ВСЕ НАЗВАНИЯ СТАВОК """
invalid_stavki = [
        'центр', 'яблочко', 'белое', 'бел', 
        'красное', 'красн', '2н', '2 нечет',
        '2нечет', 'дартс промах', 'дартс мимо', 
        'дарц промах', 'дарц мимо','2 нечёт', '2нечёт', 
        '2ч', '2 чет', '2чет', '2 чёт', '2чёт', '2б',
        '2 больше', '2больше', '2м', 'баскет промах', 
        'баскет мимо', 'баскетбол промах','баскетбол мимо', 
        '2 меньше', '2меньше', '2 меньше', 'ничья', 'п1', 'п2',
        'победа1', 'победа2', 'реклама', 'чёт', 'чет', 'нечёт', 
        'пл', 'плинко', 'plinko','1', '2', '3', '4', '5', '6', 
        'слоты', 'казик', 'нечет', 'отправил(а)', 'меньше',
        'больше', 'гол', 'попал', 'баскет гол', 'баскетбол гол', 'дартс центр',
        'дартс яблочко', 'баскет попал', 'сектор1', 'сектор 1','сектор2', 'сектор 2', 'сектор3', 
        'сектор 3', 'боул дуэль', 'боулинг дуэль',
        'дартс дуэль', 'Дартс дуэль', 'камень', 'ножницы', 'бумага',
        'фут гол', 'футбол гол', 'футбол промах', 'фут промах'
    ]